#include "timer.h"
#include "sys.h"
#include "mini51eeprom.h"
#include "steplessdimming.h"
struct TIM_Type TIME_dev={
    TIM0_init,
    0,      //定时器的计数只，每中断一次就计数一次
    0,0,    //cup计数
    0,0,    //heatcount
};
void TIM0_init(u8 pre,u32 tcmp)
{
    CLK->CLKSEL1&=~(7<<8);      //清除定时器时钟源设置
    CLK->CLKSEL1|=2<<8;         //把定时器0时钟源设置为HCLK      
    CLK->APBCLK|=1<<2;          //打开定时器0时钟
    TIMER0->TCSR&=~(3<<27);
    TIMER0->TCSR|=1<<27;        //周期模式   
    TIMER0->TCSR|=1<<29;        //开启中断    
    TIMER0->TCSR|=pre;          //预分频器设置
    TIMER0->TCMPR=tcmp;         //计数周期
    MY_NVIC_Init(TMR0_IRQn,3);  //设置中断优先级
    TIMER0->TCSR|=1<<30;        //开启定时器0
}


void TMR0_IRQHandler(void)
{
    if(TIMER0->TISR&(1<<0))
    {
        TIME_dev.time0count++;
  
/*******************************************************************************************************/
		Japan_Dim_ReadBit();//读控制引脚的值
		
/************************************************CUP操作***********************************************/

/*******************************************************************************************************/  
        
/***************************************WATER操作*******************************************************/ 
  

    

/*******************************************************************************************************/         
        if(TIME_dev.time0count>=500)
        {  
            TIME_dev.time0count=0;
			LED = ~LED;
        }
    }
    TIMER0->TISR|=1<<0;//清除标志位
}

